// Мінімум
/* 1. Запитай у користувача його вік і визначи, 
ким він є: дитиною (0-11), 
підлітком (12-17), 
дорослим (18_59) або 
пенсіонером (60 ...), 
передбач можливість введення невірних даних*/
let ageOfUser = +prompt(`Ваш вік?`);

if (ageOfUser > 1 && ageOfUser < 11) {
    alert(`Ви дитина ${ageOfUser}`);
}
else if (ageOfUser > 12 && ageOfUser < 17) {
    alert(`Ви підлітoк ${ageOfUser}`);
}
else if (ageOfUser > 18 && ageOfUser < 59) {
    alert(`Ви доросла людина ${ageOfUser}`);
}
else if (ageOfUser > 60 && ageOfUser < 120) {
    alert(`Ви пенсіонер ${ageOfUser}`);
}
// 2. Запитай у користувача число від 0 до 9 і виведи йому спецсимвол, який розташований на цій клавіші (1 !, 2 @, 3 # і т. д).
// 3. Підрахуй суму всіх чисел в заданому користувачем діапазоні.
// 4. Запитай у користувача 2 числа і знайди найбільший спільний дільник.
// 5. Запитай у користувача число і виведи всі дільники цього числа.